#### Backend Terraform Plan (dev) 📖
<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.main_table.data.aws_iam_policy_document.table_access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "table_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:ConditionCheckItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:GetItem",
              + "dynamodb:PartiQLDelete",
              + "dynamodb:PartiQLInsert",
              + "dynamodb:PartiQLSelect",
              + "dynamodb:PartiQLUpdate",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.main_table.aws_dynamodb_table.this will be created
  + resource "aws_dynamodb_table" "this" {
      + arn                         = (known after apply)
      + billing_mode                = "PAY_PER_REQUEST"
      + deletion_protection_enabled = false
      + hash_key                    = "pk"
      + id                          = (known after apply)
      + name                        = "main-dev"
      + range_key                   = "sk"
      + read_capacity               = (known after apply)
      + stream_arn                  = (known after apply)
      + stream_enabled              = false
      + stream_label                = (known after apply)
      + stream_view_type            = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Module"      = "dynamodb"
          + "Table"       = "main"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Module"      = "dynamodb"
          + "Repository"  = "john-matlock-eng/ai-lifestyle-app"
          + "Table"       = "main"
        }
      + write_capacity              = (known after apply)

      + attribute {
          + name = "pk"
          + type = "S"
        }
      + attribute {
          + name = "sk"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }

      + ttl (known after apply)
    }

  # module.main_table.aws_iam_policy.table_access will be created
  + resource "aws_iam_policy" "table_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Access policy for main-dev DynamoDB table"
      + id               = (known after apply)
      + name             = "main-dev-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Module"      = "dynamodb"
          + "Table"       = "main"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Module"      = "dynamodb"
          + "Repository"  = "john-matlock-eng/ai-lifestyle-app"
          + "Table"       = "main"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + dynamodb_access_policy_arn = (known after apply)
```

</details>

*Environment*: `dev`
*Triggered by*: @john-matlock-eng
*Action*: `pull_request`

**Note**: This plan will be automatically applied to the **dev** environment.